{"index":{"slug":"index","filePath":"index.md","title":"Welcome 👋","links":[],"tags":[],"content":"Hello. My name is Shane McDonald. I\nlive in Jersey City NJ with my lovely wife Chao, along with our cat Milla and\nour dog Rodger. I am currently employed by Red Hat as\none of the lead engineers for Ansible.\nI created this website to serve as a place where I can capture my thoughts, and\nto have a place where I can reflect on what I learn over the years. I spend a\nlot of my free time trying to find the balance between embracing cutting edge\ntechnology and living a simple life. Lately I have been trying avoid social\nmedia and attempting to maximize the time I spend thinking my own thoughts.\nI am a big fan of Emacs and\nFedora, and I very much believe that open source\nsoftware has made the world a better place, and I am proud to do my part in\ncontinuing that mission.\nIf you would like to connect, my email is on my\nGitHub profile.\nHave a nice day."},"posts/2025-03-22-my-first-post":{"slug":"posts/2025-03-22-my-first-post","filePath":"posts/2025-03-22-my-first-post.md","title":"My first post","links":[],"tags":[],"content":"Why I made this website\nIt’s been a while since I had the time or cared enough to maintain a website for\nmyself. As a software engineer, I found that over time I gradually lost interest\nin using a computer outside of work.\nThat made me sad, because I am truly grateful to be paid to do something that I\nhad at one point spent countless hours doing in my free time. After enough time\nhad passed, I began to reflect on the situation and try and start to understand\nwhat had happened. The answer seems simple now - I had stopped learning for the\nsake of learning.\nWhen acquiring new a new skill, almost every day is filled with\nfirst-encounters. Especially so with programming. The amount of information\nrequired to begin understanding how software interacts with underlying physical\nhardware is more than enough to keep you busy for multiple lifetimes. But people\ntend to achieve a level of proficiency that allows them to carry out the task at\nhand and then stop learning.\nThis is understandable - there’s only so many hours in the day and there are\nother things in life to care about. It’s largely what happened to me. Once I\nstarted making enough money to pay the bills and support my family, I felt less\nof a need to learn things outside of what it took to accomplish the immediate\ntasks at hand at work.\nWriting code for a living was enough to keep me mentally stimulated for more\nthan a decade, but once I started taking on more leadership responsibilities it\ndidn’t take long before I felt my skills begin to atrophy.\nThis is something I have heard people more senior than myself talk about my\nentire career, but when it started happening to me it felt terrifying. If I lost\nmy ability to do the thing that had gotten me to this point in the first place,\nhow long until I’m no longer useful to the people I’m entrusted to lead?\nThis may all sound a bit melodramatic, but it’s been gnawing at me for years\nnow. I just haven’t have the time, energy, or ability to do anything to change\nit. I still love my job - and it was never really an option to go back. I found\n(and still find) it very rewarding to have more of an impact than what I could\nachieve by only writing code. However, somewhat fortuitously, the less time I\nhad to do what I truly love at work, the more time I was willing to spend my\nfree time searching for ways to reintegrate this passion into my daily life.\nGoing forward\nI’ve spent the past several months rediscovering things that I had previously\nlost interest in. Simple things like building computers, installing operating\nsystems, configuring my desktop environment, and tweaking my favorite text\neditor. It’s been a lot of fun, and going forward I am going to write about them\nhere. This will mostly be a form of self-therapy and archiving for the sake of\nposterity, but I’m going to do this publicly in the off chance that someone else\nfinds anything I have to say interesting or useful. That’s it for now. Thank you\nif you’ve decided to read this far, and have a nice day."},"posts/index":{"slug":"posts/index","filePath":"posts/index.md","title":"Posts","links":[],"tags":[],"content":"These are things I’ve written."}}