{"index":{"slug":"index","filePath":"index.md","title":"Welcome 👋","links":[],"tags":[],"content":"Hello. My name is Shane McDonald. I\nlive in Jersey City NJ with my lovely wife Chao, along with our cat Milla and\nour dog Rodger. I am currently employed by Red Hat as\none of the lead engineers for Ansible.\nI created this website to serve as a place where I can capture my thoughts, and\nto have a place where I can reflect on what I learn over the years. I spend a\nlot of my free time trying to find the balance between embracing cutting edge\ntechnology and living a simple life. Lately I have been trying avoid social\nmedia and attempting to maximize the time I spend thinking my own thoughts.\nI am a big fan of Emacs and\nFedora, and I very much believe that open source\nsoftware has made the world a better place, and I am proud to do my part in\ncontinuing that mission.\nIf you would like to connect, my email is on my\nGitHub profile.\nHave a nice day."},"posts/01-my-first-post":{"slug":"posts/01-my-first-post","filePath":"posts/01-my-first-post.md","title":"My first post","links":[],"tags":[],"content":"Why I made this website\nIt’s been a while since I had the time or cared enough to maintain a website for\nmyself. As a software engineer, I found that over time I gradually lost interest\nin using a computer outside of work.\nThat made me sad, because I am truly grateful to be paid to do something that I\nhad at one point spent countless hours doing in my free time. After enough time\nhad passed, I began to reflect on the situation and try and start to understand\nwhat had happened. The answer seems simple now - I had stopped learning for the\nsake of learning.\nWhen acquiring new a new skill, almost every day is filled with\nfirst-encounters. Especially so with programming. The amount of information\nrequired to begin understanding how software interacts with underlying physical\nhardware is more than enough to keep you busy for multiple lifetimes. But people\ntend to achieve a level of proficiency that allows them to carry out the task at\nhand and then stop learning.\nThis is understandable - there’s only so many hours in the day and there are\nother things in life to care about. It’s largely what happened to me. Once I\nstarted making enough money to pay the bills and support my family, I felt less\nof a need to learn things outside of what it took to accomplish the immediate\ntasks at hand at work.\nWriting code for a living was enough to keep me mentally stimulated for more\nthan a decade, but once I started taking on more leadership responsibilities it\ndidn’t take long before I felt my skills begin to atrophy.\nThis is something I have heard people more senior than myself talk about my\nentire career, but when it started happening to me it felt terrifying. If I lost\nmy ability to do the thing that had gotten me to this point in the first place,\nhow long until I’m no longer useful to the people I’m entrusted to lead?\nThis may all sound a bit melodramatic, but it’s been gnawing at me for years\nnow. I just haven’t have the time, energy, or ability to do anything to change\nit. I still love my job - and it was never really an option to go back. I found\n(and still find) it very rewarding to have more of an impact than what I could\nachieve by only writing code. However, somewhat fortuitously, the less time I\nhad to do what I truly love at work, the more time I was willing to spend my\nfree time searching for ways to reintegrate this passion into my daily life.\nGoing forward\nI’ve spent the past several months rediscovering things that I had previously\nlost interest in. Simple things like building computers, installing operating\nsystems, configuring my desktop environment, and tweaking my favorite text\neditor. It’s been a lot of fun, and going forward I am going to write about them\nhere. This will mostly be a form of self-therapy and archiving for the sake of\nposterity, but I’m going to do this publicly in the off chance that someone else\nfinds anything I have to say interesting or useful. That’s it for now. Thank you\nif you’ve decided to read this far, and have a nice day."},"posts/02-how-i-made-this-website":{"slug":"posts/02-how-i-made-this-website","filePath":"posts/02-how-i-made-this-website.md","title":"How I made this website","links":["posts/01-my-first-post"],"tags":[],"content":"In my last post (which also happened to be My first post) I provided a little bit of context as to why I made this website. Now that I’ve gotten that over with, I’m going to continue on my merry way and pontificate on random and mostly technical things that I have been occupying my time. I figured a good place to start would be to capture how I made this website.\nMarkdown, please\nAs I’ve gotten older, I’ve begun to care more about retaining full control of my data. I’ve also developed more of a propensity towards simplicity, and that involves searching out things that I’m able to understand and easily navigate. tools that just get out of my way. At this point, writing in Markdown has become second nature. I find myself using it even I don’t mean to.\nObsidian\nI think most developers have heard of Obsidian by now - an application for writing and managing content in Markdown. Anyone who has written a lot of Markdown-based content will know that it can become unwieldy to manage over time, especially when linking between documents and using some more of its advanced features like tables. Obsidian makes these things easy, with real-time previews and the ability to automatically update links when you move things around.\nQuartz\nWhile Obsidian has its own (paid) option to publish to a website hosted on their servers, it is after all just a directory full of files. While there are several static website generators out there that support Markdown, none are quite as polished as Quartz- which also happens to be offer Obsidian compatible out of the box. If you haven’t seen Quartz before, I could not recommend it enough - it’s fast, has an extremely powerful search feature, live reloading, and is pretty much infinitely flexible if you’re willing to spend a little time learning TypeScript.\nRunning Quartz locally\nAs much as I love Quartz, I did not love how their documentation currently instructs users to clone the repository locally, install NodeJS, and store content within a fork of the Quartz project.\nCustom tooling\nTo prevent installing Node on my computer, I put together a custom Containerfile that installs the necessary dependencies and clones the Quartz repo:\nFROM registry.fedoraproject.org/fedora\n \nARG QUARTZ_REF=eccad3da5d7b84b0f78a85b357efedef8c0127fc\n \nUSER root\n \nRUN dnf install -y git make nodejs &amp;&amp; \\\n    npm install -g n &amp;&amp; \\\n    n lts &amp;&amp; \\\n    npm install -g npm@latest &amp;&amp; \\\n    dnf remove -y nodejs\n \nRUN git config --global --add safe.directory /repo\nRUN cd /opt &amp;&amp; git clone github.com/jackyzha0/quartz.git &amp;&amp; \\\n    cd quartz &amp;&amp; git checkout ${QUARTZ_REF} &amp;&amp; \\\n    npm ci\n \nCOPY quartz.config.ts /opt/quartz/\nCOPY quartz.layout.ts /opt/quartz/\n \nWORKDIR /opt/quartz\nNote here how I clone Quartz into the image and only COPY the files that I need to customize.\nWhy am I currently using a random SHA rather than a tagged version? While I was in the process of building out this website I came across this issue - although they didn’t end up accepting my PR, I’m grateful that the maintainers of Quartz were willing to collaborate and fix the underlying problem.\nMake it simple\nSome things are just better off not being rewritten in JavaScript. I think Make is one of these things. It might have first came out closer to the Moon landing than when I built this website, but it’s still more powerful than anything that’s been written in recent years and it’s way less likely to be abandoned as the project some dude wrote over the weekend and shared on Hacker News.\nSee the full version of my Makefile for this website for more information, but the gist of it is here:\n.DEFAULT_GOAL := scratchpad\n \n.PHONY: scratchpad\nscratchpad: check_image_uptodate\n\t@$(CONTAINER_RUNTIME) run --rm -ti \\\n\t\t-p $(QUARTZ_SERVER_PORT):$(QUARTZ_SERVER_PORT) \\\n\t\t-p $(QUARTZ_WEBSOCKET_PORT):$(QUARTZ_WEBSOCKET_PORT) \\\n\t\t$(COMMON_MOUNTS) \\\n\t\t$(SCRATCHPAD_IMAGE_NAME) \\\n \n.PHONY: check_image_uptodate\ncheck_image_uptodate: image\n\t@echo &quot;Checking current image SHA...&quot;\n\t@current_sha=$$($(CONTAINER_RUNTIME) inspect --format=&#039;{{.Id}}&#039; $(SCRATCHPAD_IMAGE_NAME):$(IMAGE_TAG) 2&gt;/dev/null || echo &quot;none&quot;); \\\n\tstored_sha=$$(cat $(IMAGE_ID_FILE) 2&gt;/dev/null || echo &quot;none&quot;); \\\n\tif [ &quot;$$current_sha&quot; != &quot;$$stored_sha&quot; ] || [ -z &quot;$$current_sha&quot; ]; then \\\n\t\techo &quot;Building image... $$current_sha $$stored_sha&quot;; \\\n\t\t$(MAKE) -B -f $(MAKEFILE_PATH) image; \\\n\telse \\\n\t\techo &quot;Image is up to date.&quot;; \\\n\tfi\n \n.PHONY: image\nimage: $(IMAGE_ID_FILE)\n \n$(IMAGE_ID_FILE): .generated Containerfile quartz.config.ts quartz.layout.ts\n\t$(CONTAINER_RUNTIME) build -t $(SCRATCHPAD_IMAGE_NAME):$(IMAGE_TAG) .\n\t$(CONTAINER_RUNTIME) inspect --format=&#039;{{.Id}}&#039; $(SCRATCHPAD_IMAGE_NAME):$(IMAGE_TAG) &gt; $(IMAGE_ID_FILE)\nThe result here is that on a machine with just make and podman (or docker) installed, I can simply clone this repo and run the command:\n➜  shanemcd.github.io git:(main) ✗ make\nChecking current image SHA...\nImage is up to date.\nnpx quartz build --serve --port=6006 --directory=/repo/content\n\n Quartz v4.5.0\n\nCleaned output directory `public` in 2ms\nFound 4 input files from `/repo/content` in 5ms\nParsed 4 Markdown files in 112ms\nFiltered out 0 files in 24μs\nEmitted 16 files to `public` in 71ms\nDone processing 4 files in 191ms\nStarted a Quartz server listening at http://localhost:6006\n\nThis handles building (and rebuilding) the container image, starting serving Quartz, mounting in the site content, and mapping ports for the web server and live-reload websocket.\nDeploying via GitHub Pages\nMost people are familiar with using GitHub Pages to host a Jekyll website, but it is also possible to serve up a pre-built HTML website that has been pushed to a branch. To automate this process I threw together this GitHub Action:\n# Simple workflow for deploying static content to GitHub Pages\nname: Deploy static content to Pages\n \npermissions:\n  contents: write\n \non:\n  # Runs on pushes targeting the default branch\n  push:\n    branches: [&quot;main&quot;]\n \n# Allow only one concurrent deployment, skipping runs queued between the run in-progress and latest queued.\n# However, do NOT cancel in-progress runs as we want to allow these production deployments to complete.\nconcurrency:\n  group: &quot;pages&quot;\n  cancel-in-progress: false\n \nenv:\n  CONTAINER_RUNTIME: docker\n  RUN_CMD: &gt;-\n    QUARTZ_BUILD_OPTS=&#039;-o /repo/public&#039; make -f /repo/Makefile public\n \njobs:\n  # Single deploy job since we&#039;re just deploying\n  deploy:\n    environment:\n      name: github-pages\n      url: ${{ steps.deployment.outputs.page_url }}\n    runs-on: ubuntu-latest\n    steps:\n      - name: Checkout\n        uses: actions/checkout@v4\n        with:\n          fetch-depth: 0\n \n      - name: Build site\n        run: make run\n \n      - name: Upload artifact\n        uses: actions/upload-pages-artifact@v3\n        with:\n          path: public\n \n      - name: Deploy 🚀\n        uses: JamesIves/github-pages-deploy-action@v4\n        with:\n          folder: public\n          branch: gh-pages\n          clean-exclude: pr-preview\n          force: false\nPreviewing changes\nI might be lazy, but I also love finding a good problem to over-engineer. I had originally done this for a project at work, but was able to reuse here without much effort.\nUnfortunately GitHub Pages does not natively support previewing changes. It seems like that will come at some point, but it’s been almost 5 years and there’s still ETA. Luckily the Deploy PR Preview action will do just fine for now.\nHere is how I’m using it. The only thing I’ve changed is an additional invocation of marocchino/sticky-pull-request-comment, which I found rossjrw/pr-preview-action uses under the hood. I update the comment it posts to add a little reminder that the link will only work once the Action completes.\n---\nname: preview\n \npermissions:\n  contents: write\n  pull-requests: write\n \nconcurrency: preview-${{ github.ref }}\n \non:\n  pull_request_target:\n    types:\n      - opened\n      - reopened\n      - synchronize\n      - closed\n \nenv:\n  CONTAINER_RUNTIME: docker\n  RUN_CMD: &gt;-\n    QUARTZ_BUILD_OPTS=&#039;-o /repo/public&#039; make -f /repo/Makefile public\n \njobs:\n  preview:\n    runs-on: ubuntu-20.04\n    steps:\n      - name: Checkout\n        uses: actions/checkout@v3\n        with:\n          ref: refs/pull/${{ github.event.pull_request.number }}/merge\n          fetch-depth: 0\n \n      - run: |\n          git log\n \n      - name: Build site\n        if: github.event.action != &#039;closed&#039;\n        run: make run\n \n      - name: Deploy preview\n        uses: rossjrw/pr-preview-action@v1\n        with:\n          source-dir: public\n \n      - name: Update preview comment with note about being patient\n        uses: marocchino/sticky-pull-request-comment@v2\n        with:\n          header: pr-preview\n          append: true\n          message: |\n            &gt; [!IMPORTANT]\n            &gt; The link above will not work until the Pages deployment is complete. You can find this under [Actions -&gt; pages-build-deployment](github.com/andyettanotherorg/shanemcd.github.io/actions/workflows/pages/pages-build-deployment).\nWhich looks like this:\n\nThis might be overkill, but it lets me test things out without iterating directly on my main branch and helps for cases where I might not have access to Obsidian or the ability to test a site build locally.\nWrapping up\nI mostly captured this for my own posterity, but if for whatever reason you find yourself wanting to learn more please about any of this please check out the source for this website. If you have any questions or just want to say hi, my email is on my GitHub profile."},"posts/index":{"slug":"posts/index","filePath":"posts/index.md","title":"Posts","links":[],"tags":[],"content":"These are things I’ve written."}}